# 4)Подсчет букв
# Дано строка и буква => "fizbbbuz","b", нужно подсчитать сколько раз буква b встречается в заданной строке                                                     "Hello there", "e" == 3
# "Hello there", "t" == 1
# "Hello there", "h" == 2
# "Hello there", "L" == 2
# "Hello there", " " == 1

string1 = 'fizbbbuz'
char = 'b'
num1 = string1.count(char)
print(f'{string1}, {char} == {num1}')




